app/views/static_pages/about.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
---
<% if session[:uid] == nil || !User.find(session[:uid]).developer %>

SELECT "matches".* FROM "matches" WHERE "matches"."approved" = 'f'
---
<% else %>
<% @NOTapprovedMatches = Match.where(:approved => false) %>