app/views/static_pages/home.html.erb

<% @approvedMatches = Match.where(:approved => true) %>
---
SELECT "matches".* FROM "matches" WHERE "matches"."approved" = 't'