app/controllers/matches_controller.rb

        def create
	  @match = Match.new(match_params)
	  if @match.save
---
INSERT INTO "matches" ("Lpic", "Ltitle", "Rpic", "Rtitle", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Lpic", "I"], ["Ltitle", "A"], ["Rpic", "Made"], ["Rtitle", "Match"], ["created_at", Fri, 28 Mar 2014 02:52:20 UTC +00:00], ["updated_at", Fri, 28 Mar 2014 02:52:20 UTC +00:00]]

	def get_unapproved
		require 'json'
		@NOTapprovedMatches = Match.where(:approved => false)
		if @NOTapprovedMatches.count == 0
---
SELECT "matches".* FROM "matches" WHERE "matches"."approved" = 'f'
SELECT COUNT(*) FROM "matches" WHERE "matches"."approved" = 'f'

	def approve
		@match = Match.find(params[:id])
		@match.approved = true
		@match.save!
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", "3"]]
UPDATE "matches" SET "approved" = $1, "updated_at" = $2 WHERE "matches"."id" = 3  [["approved", true], ["updated_at", Tue, 13 May 2014 23:16:35 UTC +00:00]]

	def destroy
		@match = Match.find(params[:id])
		@match.destroy
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 2]]