app/views/layouts/_header.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
			<% if session[:uid] != nil %>
				<%if User.find(session[:uid]).developer%>